Repository: jtsato/querystring-composer-api-netcore
Catalog: src/main/EntryPoint.WebApi/Resources/Messages.*.resx
Languages: pt_br

# CommonUnexpectedException
source: An unexpected error has occurred, please try again later!
pt_br: Ocorreu um erro inesperado, por favor tente novamente mais tarde!

# CommonValidationAlert
source: Please correct the errors and send your information again!
pt_br: Favor corrigir os erros e enviar os dados novamente!

# CommonUnexpectedExceptionWithParams
source: An unexpected error has occurred, please try again later! Details: {0}.
pt_br: Ocorreu um erro inesperado, por favor tente novamente mais tarde! Detalhes: {0}.

# CommonInvalidRequest
source: The request received is invalid. Check the format and the parameters in the documentation, correct them and try again.
pt_br: A solicitação recebida é inválida. Verifique o formato e os parâmetros na documentação, corrija-os e tente novamente.

# CommonJsonPropertyMissing
source: The property '{0}' is required.
pt_br: A propriedade '{0}' é obrigatória.

# CommonJsonPropertyInvalid
source: The property '{0}' is invalid.
pt_br: A propriedade '{0}' é inválida.

# CommonJsonPropertyWrongType
source: The property '{0}' has a value not compatible with it's expected type.
pt_br: A propriedade '{0}' possui um valor incompatível com o seu tipo esperado.

# ValidationSearchTermsIsNullOrEmpty
source: The 'search term' is missing.
pt_br: O campo 'termo de busca' é obrigatório.

# ValidationClientUidIsNullOrEmpty
source: Required client identifier is missing.
pt_br: O Identificador do cliente é obrigatório.

# ValidationQueryNameIsNullOrEmpty
source: The 'query name' is missing.
pt_br: O nome da query é obrigatório.

# ValidationDescriptionIsNullOrEmpty
source: Required client description is missing.
pt_br: A descrição do cliente é obrigatório.

# ValidationNameIsNullOrEmpty
source: Required client name is missing.
pt_br: O nome do cliente é obrigatório.

# ValidationAiSettingsIsNull
source: The 'ai settings' is missing.
pt_br: As configurações da IA são obrigatórias.

# ValidationApiKeyIsNullOrEmpty
source: The 'API Key' is mandatory when AI is enabled.
pt_br: A API Key é obrigatória quando a IA está habilitada.

# ValidationMaxTokensExceedsLimit
source: The max tokens exceeds the limit.
pt_br: O número máximo de tokens excede o limite.

# ValidationMaxTokensIsNotInteger
source: The max tokens exceeds is not integer.
pt_br: O valor máximo de tokens não é um número inteiro.

# ValidationMaxTokensIsNullOrEmpty
source: The max tokens exceeds is missing.
pt_br: O valor máximo de tokens é obrigatório quando a IA está habilitada.

# ValidationModelIsNullOrEmpty
source: The model is missing.
pt_br: O modelo é obrigatóriao quando a IA está habilitada.

# ValidationPromptTemplateIsNullOrEmpty
source: The 'prompt template' is missing.
pt_br: O 'modelo de prompt' é obrigatória quando a IA está habilitada.

# ValidationTemperatureIsNullOrEmpty
source: The 'temperature' is missing.
pt_br: O campo de temperatura é obrigatório quando a IA está habilitada.

# ValidationTemperatureIsNotFloat
source: The 'temperature' is not a valid float number.
pt_br: O campo de temperatura não é um valor decimal válido.

# ValidationUsagePercentageIsNotPercentage
source: The 'percentage' is not a valid percentage.
pt_br: O campo percentual não é um valor válido.

# ValidationUsagePercentageIsNullOrEmpty
source: The 'percentage' is missing.
pt_br: O campo percentual é obrigatório quando a IA está habilitada.
